In [200]:
import pandas as pd

##Extraction

In [201]:
travel_data = pd.read_csv('https://drive.google.com/uc?id=1muwnik-uFGTKBdHmcQN5z68rD7qmdG-b')

In [202]:
travel_data.shape

(418, 6)

In [203]:
travel_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    object
 3   Travel End Date        418 non-null    object
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      415 non-null    object
dtypes: float64(1), object(5)
memory usage: 19.7+ KB

In [204]:
travel_data.head(4)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference

In [205]:
travel_data.describe

<bound method NDFrame.describe of               Employee     Destination Travel Start Date Travel End Date  \
0         Aaron Salter  OCEAN CITY, MD        2017-05-31      2017-06-02
1    Abigail Ratnofsky   SAN DIEGO, CA        2016-01-24      2016-01-29
2       Adam Kisthardt     ORLANDO, FL        2018-10-04      2018-10-09
3        Adam P. Jones  OCEAN CITY, MD        2016-06-19      2016-06-21
4          Alan Butsch   SAN DIEGO, CA        2019-11-19      2019-11-22
..                 ...             ...               ...             ...
413     Warren Jensen!  OCEAN CITY, MD   2017-11-06           2017-11-09
414        Warp Jensen  OCEAN CITY, MD        2019-03-25      2019-03-26
415     Whitney Kujawa  OCEAN CITY, MD        2017-11-06      2017-11-09
416      William Kinna   CHARLOTTE, NC        2017-05-21      2017-05-26
417             Xin Qi  OCEAN CITY, MD        2019-08-13      2019-08-17

     Actual Total Expenses Purpose Of Travel
0                   644.10        Conference
1                  2962.70        Conference
2                  1891.19        Conference
3                   324.36        Conference
4                  2141.51        Conference
..                     ...               ...
413                 502.45        Conference
414                  78.00        Conference
415                 567.00        Conference
416                2163.67        Conference
417                2107.51        Conference

[418 rows x 6 columns]>

In [206]:
travel_data = travel_data.drop_duplicates()

In [207]:
travel_data.shape
# no duplicate data found

(418, 6)

## Cleaning

In [208]:
travel_dataset = travel_data.copy()

In [209]:
type(travel_dataset['Travel Start Date'])

pandas.core.series.Series

In [210]:
# function to remove white space
def remove_white_space(text):
    if type(text) == str:
        return  text.strip()
    return text

In [211]:
# applying the remove white space fxn
travel_dataset['Travel Start Date'] = travel_dataset['Travel Start Date'].apply(remove_white_space)

travel_dataset['Travel End Date'] = travel_dataset['Travel End Date'].apply(remove_white_space)

In [212]:
# converting to datetime
travel_dataset['Travel Start Date'] = pd.to_datetime(travel_dataset['Travel Start Date'])
travel_dataset['Travel End Date'] = pd.to_datetime(travel_dataset['Travel End Date'])

In [213]:
travel_dataset[travel_dataset['Purpose Of Travel'].isna()]

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel
126,Gaila Compton,"OCEAN CITY, MD",2019-09-25,2019-09-27,690.00,NaN
274,Mark Sheelor,"LAS VEGAS, NV",2017-03-06,2017-03-08,1411.34,NaN
385,Tamara Maldonado,"OCEAN CITY, MD",2017-10-19,2017-10-20,73.50,NaN

In [214]:
travel_dataset['Purpose Of Travel']= travel_dataset['Purpose Of Travel'].fillna('Not Provided')

In [215]:
travel_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    datetime64[ns]
 3   Travel End Date        418 non-null    datetime64[ns]
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      418 non-null    object
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 19.7+ KB

In [216]:
# extracting state and city from destination
def extract_state(text):
    result = text.lower()
    result = text.split(',')[1]
    return result

def extract_city(text):
    result = text.lower()
    result = text.split(',')[0]
    return result

In [217]:
travel_dataset['state'] = travel_dataset['Destination'].apply(extract_state)
travel_dataset['city'] = travel_dataset['Destination'].apply(extract_city)

In [218]:
travel_dataset.head(4)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,city
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference,MD,OCEAN CITY
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference,CA,SAN DIEGO
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference,FL,ORLANDO
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference,MD,OCEAN CITY

In [219]:
# extracting first name and last name from employee column
def extract_fname(text):
    result = text.capitalize()
    result = text.split(' ')[0]
    return result

def extract_lname(text):
    result = text.capitalize()
    result = text.split(' ')[1]
    return result

In [220]:
travel_dataset['first_name'] = travel_dataset['Employee'].apply(extract_fname)
travel_dataset['last_name'] = travel_dataset['Employee'].apply(extract_lname)

In [221]:
travel_dataset.head(7)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,city,first_name,last_name
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference,MD,OCEAN CITY,Aaron,Salter
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference,CA,SAN DIEGO,Abigail,Ratnofsky
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference,FL,ORLANDO,Adam,Kisthardt
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference,MD,OCEAN CITY,Adam,P.
4,Alan Butsch,"SAN DIEGO, CA",2019-11-19,2019-11-22,2141.51,Conference,CA,SAN DIEGO,Alan,Butsch
5,Alberto Hook,"AUSTIN, TX",2016-04-17,2016-04-22,1856.49,Conference,TX,AUSTIN,Alberto,Hook
6,Alberto Rein,"OCEAN CITY, MD",2019-09-08,2019-09-12,330.08,Conference,MD,OCEAN CITY,Alberto,Rein

In [222]:
# removing special characters
def remove_xter(txt):
    result = txt.replace('@', '')
    result= result.replace('!', '')
    
    return result

In [223]:
travel_dataset['Employee'] = travel_dataset['Employee'].apply(remove_xter)

In [224]:
travel_dataset.tail(15)

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,city,first_name,last_name
403,Todd Harper,"ORLANDO, FL",2016-10-15,2016-10-21,5650.16,Conference,FL,ORLANDO,Todd,Harper
404,Tom Henry,"ORLANDO, FL",2018-03-04,2018-03-10,4626.29,Conference,FL,ORLANDO,Tom,Henry
405,Tony Galladora,"CHARLOTTE, NC",2017-05-22,2017-05-26,972.33,Other,NC,CHARLOTTE,Tony,@Galladora
406,Trent Bishop,"WESTMINSTER, CO",2016-09-18,2016-09-21,2849.13,Conference,CO,WESTMINSTER,Trent,Bishop
407,Troy Tippett,"ORLANDO, FL",2018-08-05,2018-08-09,4616.69,Training,FL,ORLANDO,Troy,Tippett
408,Tyler Wellen,"OCEAN CITY, MD",2016-10-24,2016-10-26,111.50,Conference,MD,OCEAN CITY,Tyler,Wellen
409,Tyrone Dement,"CHARLOTTE, NC",2018-02-19,2018-02-23,265.50,Conference,NC,CHARLOTTE,Tyrone,Dement
410,Victoria Lewis,"AUSTIN, TX",2018-05-16,2018-05-18,2355.52,Conference,TX,AUSTIN,Victoria,Lewis
411,Vincent Romano,"OCEAN CITY, MD",2016-10-24,2016-10-26,82.50,Conference,MD,OCEAN CITY,Vincent,Romano
412,Wins Hinde,"OCEAN CITY, MD",2016-06-17,2016-06-22,352.00,Conference,MD,OCEAN CITY,Wins,Hinde
413,Warren Jensen,"OCEAN CITY, MD",2017-11-06,2017-11-09,502.45,Conference,MD,OCEAN CITY,Warren,Jensen!
414,Warp Jensen,"OCEAN CITY, MD",2019-03-25,2019-03-26,78.00,Conference,MD,OCEAN CITY,Warp,Jensen
415,Whitney Kujawa,"OCEAN CITY, MD",2017-11-06,2017-11-09,567.00,Conference,MD,OCEAN CITY,Whitney,Kujawa
416,William Kinna,"CHARLOTTE, NC",2017-05-21,2017-05-26,2163.67,Conference,NC,CHARLOTTE,William,Kinna
417,Xin Qi,"OCEAN CITY, MD",2019-08-13,2019-08-17,2107.51,Conference,MD,OCEAN CITY,Xin,Qi

In [225]:
columns = ['Employee', 'first_name', 'last_name', 'state', 'city', 'Travel Start Date', 'Travel End Date', 'Actual Total Expenses', 'Purpose Of Travel']

final_result = travel_dataset[columns].copy()

In [226]:
final_result.to_csv('cleaned_travel_dataset.csv')

## US Demography

In [235]:
url = 'https://public.opendatasoft.com/api/explore/v2.1/catalog/datasets/us-cities-demographics/exports/json?lang=en&timezone=Africa%2FLagos'

actual_demography = pd.read_json(url)

In [236]:
demography = actual_demography.copy()
demography.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2891 entries, 0 to 2890
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city                    2891 non-null   object
 1   state                   2891 non-null   object
 2   median_age              2891 non-null   float64
 3   male_population         2888 non-null   float64
 4   female_population       2888 non-null   float64
 5   total_population        2891 non-null   int64
 6   number_of_veterans      2878 non-null   float64
 7   foreign_born            2878 non-null   float64
 8   average_household_size  2875 non-null   float64
 9   state_code              2891 non-null   object
 10  race                    2891 non-null   object
 11  count                   2891 non-null   int64
dtypes: float64(6), int64(2), object(4)
memory usage: 271.2+ KB

In [254]:
demography.head(4)

,city,state,median_age,male_population,female_population,total_population,number_of_veterans,foreign_born,average_household_size,state_code,race,count
0,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402
1,Peoria,Illinois,33.1,56229.0,62432.0,118661,6634.0,7517.0,2.40,IL,American Indian and Alaska Native,1343
2,O'Fallon,Missouri,36.0,41762.0,43270.0,85032,5783.0,3269.0,2.77,MO,Hispanic or Latino,2583
3,Hampton,Virginia,35.5,66214.0,70240.0,136454,19638.0,6204.0,2.48,VA,Black or African-American,70303